app/controllers/api/chatrooms_controller.rb

  def index
    if params[:query].present?
      @channels = Chatroom.where('title ~ ?', params[:query])
---
SELECT "chatrooms".* FROM "chatrooms" WHERE (creator_id = 76)

  def show
    @chatroom = Chatroom.find(params[:id])
---
SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]